app/Models/WatchModel.php

SELECT *
FROM `watch`
SELECT *
FROM `watch`
WHERE `slug` = 'sukasuka'
 LIMIT 1
---
    public function getAnime($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();